# FamilyExportAsGeometry Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyExportAsGeometry Property
ParameterTypeId Class See Also
---
"Always export as geometry"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyExportAsGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyExportAsGeometry As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyExportAsGeometry {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace